## Data Frame

In [91]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [92]:
df1 = pd.DataFrame({"Ad":["İstanbul", "Ankara", "İzmir", "Bursa", "Antalya"], 
                   "Nüfus":[150229231, 5445026, 4279677, 2936803, 2364396],
                   "Kod":["34", "06", "35", "16", "07"]
                  })
df1
# Kolonlar(Değişkenler/Variables)
# Satırlar(Gözlemler/Observations)

         Ad      Nüfus Kod
0  İstanbul  150229231  34
1    Ankara    5445026  06
2     İzmir    4279677  35
3     Bursa    2936803  16
4   Antalya    2364396  07

In [93]:
dizi1 = np.array([[0,1,2,3],[4,5,6,7]])
df2 = pd.DataFrame(dizi1)
df2

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [94]:
df2.columns = ["Column 1", "Column 2", "Column 3", "Column 4"]
df2.index = ["Row 1", "Row 2"]
# veya   df2.pd.DataFrame(dizi1, columns=["Column 1", ....], index=["Row 1", ....])
df2

       Column 1  Column 2  Column 3  Column 4
Row 1         0         1         2         3
Row 2         4         5         6         7

In [95]:
# boş veri çerçevesi oluşturup sonradan da ekleyebiliriz.
df3 = pd.DataFrame()
df3["Column 1"] = [9,8,7,6]
df3["Column 2"] = [5,4,3,2]
df3.index = ["Row 1", "Row 2", "Row 3", "Row 4"]
df3

       Column 1  Column 2
Row 1         9         5
Row 2         8         4
Row 3         7         3
Row 4         6         2

## **Bu kısmı anlamadım:<br>**
"Pep8 ile ilgili küçük bir not: Muhtemelen iki yanında boşluk olan ” = “ i değer atama için, “==” i ise karşılaştırma için kullanıyorsunuz. Python'da, okunabilirliği geliştirmek ve argumanlar atamalarını değişken atamalarından ayırt etmeyi kolaylaştırmak için “=” in iki yanında boşluk kullanılmaması alışkanlığı yerleşmiştir."

In [96]:
ulke_kod = ['FR', 'GE', 'US', 'UK', 'CN']
ulkeler = pd.DataFrame(index=ulke_kod)
ulkeler.index.name = "Kod"
ulkeler

Empty DataFrame
Columns: []
Index: [FR, GE, US, UK, CN]

In [97]:
ulkeler["Ülke"] = ['Fransa', 'Almanya', 'ABD', 'İngiltere', 'Çin']
ulkeler["Nüfus"] = [61083916, 82400996, 301139947, 60776238, 1318683096]
ulkeler["Yaşam Süresi"] = [80.657, 79.406, 78.242 ,79.425, 72.961]
ulkeler["Toplam Gelir"] = [2657213249384, 3439953462907, 14477635000000, 3074359743897, 3552182311652]
ulkeler["Kıta"] = ['Avrupa', 'Avrupa', 'Amerika', 'Avrupa', 'Asya']
## "Ort. Yaşam Süresi" ismini değiştirdim fakat yeni bir sütun olarak geldi. Silemedim.
## del ulkeler["Ort. Yaşam Süresi"] yazınca oldu. Bu doğru bir yöntem mi? Arkasında bir data falan bıraktı mı? .drop
ulkeler["Yıl"] = 2007
ulkeler

          Ülke       Nüfus  Yaşam Süresi    Toplam Gelir     Kıta   Yıl
Kod
FR      Fransa    61083916        80.657   2657213249384   Avrupa  2007
GE     Almanya    82400996        79.406   3439953462907   Avrupa  2007
US         ABD   301139947        78.242  14477635000000  Amerika  2007
UK   İngiltere    60776238        79.425   3074359743897   Avrupa  2007
CN         Çin  1318683096        72.961   3552182311652     Asya  2007

In [98]:
print(ulkeler["Nüfus"], "\n")    ## dot notation veya bracket notation. ikisi de olur
print(ulkeler.Nüfus)             ## fakat sütun isminde boşluk varsa, patlar. ["bu daha yaygın kullanılıyor"]
## bu altlardaki Name:  kısmını nasıl kaldırıyoruz?
print("\nType is: ", type(ulkeler.Nüfus))

# Bu şekilde tek sutundan oluşan dataframe parçası karşımıza Seri (Series) olarak çıkacak.
# Bu seri aynı zamanda tek boyutlu bir dizidir.

Kod
FR      61083916
GE      82400996
US     301139947
UK      60776238
CN    1318683096
Name: Nüfus, dtype: int64

Kod
FR      61083916
GE      82400996
US     301139947
UK      60776238
CN    1318683096
Name: Nüfus, dtype: int64

Type is:  <class 'pandas.core.series.Series'>

In [99]:
print(ulkeler[["Nüfus"]], "\n")
print("Type is: ", type(ulkeler[["Nüfus"]]))

          Nüfus
Kod
FR     61083916
GE     82400996
US    301139947
UK     60776238
CN   1318683096

Type is:  <class 'pandas.core.frame.DataFrame'>

In [100]:
ulkeler["Kişi Başı Gelir"] = (ulkeler["Toplam Gelir"] / ulkeler.Nüfus).astype(int)    # işlem yaparak yeni sütun oluşturma
ulkeler

,Ülke,Nüfus,Yaşam Süresi,Toplam Gelir,Kıta,Yıl,Kişi Başı Gelir
Kod,,,,,,,
FR,Fransa,61083916,80.657,2657213249384,Avrupa,2007,43501
GE,Almanya,82400996,79.406,3439953462907,Avrupa,2007,41746
US,ABD,301139947,78.242,14477635000000,Amerika,2007,48076
UK,İngiltere,60776238,79.425,3074359743897,Avrupa,2007,50584
CN,Çin,1318683096,72.961,3552182311652,Asya,2007,2693

## Satır/Sütun Seçme

In [101]:
ulkeler[["Ülke"]]
# Bu tek sütunu seri ya da dizi almak istemiyorsak, yine veri çerçevesinde tutmak istiyorsak iki köşeli parantez kullanmalıyız.

          Ülke
Kod
FR      Fransa
GE     Almanya
US         ABD
UK   İngiltere
CN         Çin

In [102]:
ulkeler["Ülke"]

Kod
FR       Fransa
GE      Almanya
US          ABD
UK    İngiltere
CN          Çin
Name: Ülke, dtype: object

In [103]:
# Şekil olarak baktığımızda çok fark yokmuş gibi görünse de
# sahip oldukları fonksiyonları ve metodları irdelemeye başlayınca farklarını göreceğiz.
# Birden fazla sütun seçeceğimiz zaman ise iki köşeli parantez kesinlikle gerekli.

ulkeler[["Ülke", "Yaşam Süresi"]]

          Ülke  Yaşam Süresi
Kod
FR      Fransa        80.657
GE     Almanya        79.406
US         ABD        78.242
UK   İngiltere        79.425
CN         Çin        72.961

In [104]:
ulkeler[2:4]

,Ülke,Nüfus,Yaşam Süresi,Toplam Gelir,Kıta,Yıl,Kişi Başı Gelir
Kod,,,,,,,
US,ABD,301139947,78.242,14477635000000,Amerika,2007,48076
UK,İngiltere,60776238,79.425,3074359743897,Avrupa,2007,50584

In [105]:
ulkeler.loc[["GE"]]
# type(ulkeler.loc[["GE"]])  --> <class 'pandas.core.frame.DataFrame'>

,Ülke,Nüfus,Yaşam Süresi,Toplam Gelir,Kıta,Yıl,Kişi Başı Gelir
Kod,,,,,,,
GE,Almanya,82400996,79.406,3439953462907,Avrupa,2007,41746

In [106]:
ulkeler.loc["GE"]
# type(ulkeler.loc["GE"])  --> pandas.core.series.Series

Ülke                     Almanya
Nüfus                   82400996
Yaşam Süresi              79.406
Toplam Gelir       3439953462907
Kıta                      Avrupa
Yıl                         2007
Kişi Başı Gelir            41746
Name: GE, dtype: object

In [107]:
ulkeler.loc["US":,"Yaşam Süresi":]
# type(ulkeler.loc["US":,"Yaşam Süresi":])  --> pandas.core.frame.DataFrame

     Yaşam Süresi    Toplam Gelir     Kıta   Yıl  Kişi Başı Gelir
Kod
US         78.242  14477635000000  Amerika  2007            48076
UK         79.425   3074359743897   Avrupa  2007            50584
CN         72.961   3552182311652     Asya  2007             2693

In [108]:
ulkeler.loc["US":, "Yaşam Süresi"]
## print(type(ulkeler.loc["US":,"Yaşam Süresi"]))  -->  <class 'pandas.core.series.Series'>

Kod
US    78.242
UK    79.425
CN    72.961
Name: Yaşam Süresi, dtype: float64

In [109]:
ulkeler.loc["GE", "Nüfus"]    # almanya'nın nüfusunu seçtik
## type(ulkeler.loc["GE", "Nüfus"])  --> numpy.int64

82400996

In [110]:
ulkeler.iloc[2:4,1:3]

         Nüfus  Yaşam Süresi
Kod
US   301139947        78.242
UK    60776238        79.425

## Koşullu Seçim

In [111]:
ulkeler

,Ülke,Nüfus,Yaşam Süresi,Toplam Gelir,Kıta,Yıl,Kişi Başı Gelir
Kod,,,,,,,
FR,Fransa,61083916,80.657,2657213249384,Avrupa,2007,43501
GE,Almanya,82400996,79.406,3439953462907,Avrupa,2007,41746
US,ABD,301139947,78.242,14477635000000,Amerika,2007,48076
UK,İngiltere,60776238,79.425,3074359743897,Avrupa,2007,50584
CN,Çin,1318683096,72.961,3552182311652,Asya,2007,2693

In [112]:
ulkeler.loc[lambda df: ulkeler["Nüfus"]>1e8, :]    # .loc[] ve lambda ile koşullama

,Ülke,Nüfus,Yaşam Süresi,Toplam Gelir,Kıta,Yıl,Kişi Başı Gelir
Kod,,,,,,,
US,ABD,301139947,78.242,14477635000000,Amerika,2007,48076
CN,Çin,1318683096,72.961,3552182311652,Asya,2007,2693

In [113]:
ulkeler.loc[ulkeler["Nüfus"]>1e8, "Nüfus":"Kıta"]    # lambda kullanmadan koşullama

          Nüfus  Yaşam Süresi    Toplam Gelir     Kıta
Kod
US    301139947        78.242  14477635000000  Amerika
CN   1318683096        72.961   3552182311652     Asya

In [114]:
ulkeler[ulkeler["Nüfus"]>1e8]    # .loc[] ve lambda kullanmadan koşullama. ,"Nüfus":"Kıta" gibi column slicing yapamıyoruz

,Ülke,Nüfus,Yaşam Süresi,Toplam Gelir,Kıta,Yıl,Kişi Başı Gelir
Kod,,,,,,,
US,ABD,301139947,78.242,14477635000000,Amerika,2007,48076
CN,Çin,1318683096,72.961,3552182311652,Asya,2007,2693

## Gruplama

In [115]:
ulkeler.groupby("Kıta")
# "Dikkat ettiyseniz, yukarıdaki satırı çalıştırdığımızda bize veri çerçevemiz içindeki verileri döndürmedi.
# Gruplandırmayı temsil eden bir nesne döndürdü. Mantığı şu:
# gruplandırma sonucunda bir veri döndürmek istiyorsak, o gruplarda bazı işlemler yapmamız gerekiyor."

In [116]:
ulkeler.groupby("Kıta").count()

         Ülke  Nüfus  Yaşam Süresi  Toplam Gelir  Yıl  Kişi Başı Gelir
Kıta
Amerika     1      1             1             1    1                1
Asya        1      1             1             1    1                1
Avrupa      3      3             3             3    3                3

In [117]:
ulkeler.groupby("Kıta").mean()
# pandas.core.frame.DataFrame

              Nüfus  Yaşam Süresi    Toplam Gelir   Yıl  Kişi Başı Gelir
Kıta
Amerika   301139947     78.242000  14477635000000  2007            48076
Asya     1318683096     72.961000   3552182311652  2007             2693
Avrupa     68087050     79.829333   3057175485396  2007            45277

In [118]:
ulkeler.groupby("Kıta")["Kişi Başı Gelir"].mean()
# pandas.core.series.Series

Kıta
Amerika    48076
Asya        2693
Avrupa     45277
Name: Kişi Başı Gelir, dtype: int32

In [119]:
pd.DataFrame(ulkeler.groupby("Kıta")["Kişi Başı Gelir"].mean()) # Data Frame olarak gösterebilir miyim diye merak ettim, oldu.

         Kişi Başı Gelir
Kıta
Amerika            48076
Asya                2693
Avrupa             45277

In [120]:
pd.DataFrame( ulkeler.groupby(by="Kıta")["Nüfus"].sum() )    # by= ile bir şey değişmedi.

              Nüfus
Kıta
Amerika   301139947
Asya     1318683096
Avrupa    204261150

## Veri Çerçevelerini Bağlama/Birleştirme

### Bağlama (Concatenation)

In [121]:
yeni_ulkeler = pd.DataFrame({"Kod":["IT", "IN", "JP"]})
yeni_ulkeler = pd.DataFrame({"Ülke":["İtalya", "Hindistan", "Japonya"],
                             "Nüfus":[58147733, 1110396331, 127467972],
                             "Yaşam Süresi":[80.546, 64.698, 82.603],
                            "Toplam Gelir":[2203053380782, 1201111768410, 4515264514430], 
                            "Kıta":["Avrupa", "Asya", "Asya"], 
                            "Kişi Başı Gelir":[37887, 1081, 35422], 
                            "Yıl":[2007, 2007, 2007]}, index=yeni_ulkeler["Kod"])

# yeni_ulkeler = pd.read_csv("data/yeni_ulkeler.csv", index_col=0)    # index_col, index'i 0 olan column'u index olarak seç demek.

tum_ulkeler = pd.concat([ulkeler, yeni_ulkeler], ignore_index=True, axis=0)

# aynı kolonlara (variables) sahip yeni ülkeleri, öncekiyle birleştirip yeni değere atadık.
# ignore_index=True yazmazsak, iki DataFrame'i birleştirirken, index'ler birlikte geleceği için,
# aynı index numaraları atanabilir, çakışabilir. Yukarıda IT, IN, JP gibi index isimleri verildiği için çakışma olmadı gerçi.
# axis=0 satır (row) eklemesi yaparken, axis=1 sütun (column) eklemesi yapıyor. axis=0 yazmasak da olurdu. default zaten.

In [122]:
# axis=1 için örnek:
ulkeler_iki = pd.DataFrame({"Ülke": ["Japonya", "Fransa"]}, index=["JP", "FR"])
baskent_concat = pd.DataFrame({"Başkent": ["Tokyo", "Paris"]}, index=["JP", "FR"])
ulkeler_concat = pd.concat([ulkeler_iki, baskent_concat], axis=1)    # axis=0 yapıp ne değiştiğini görebilirsin.
ulkeler_concat

       Ülke Başkent
JP  Japonya   Tokyo
FR   Fransa   Paris

### Birleştirme (Merge)

In [123]:
# .concat() ile veri çerçeveleri birbirine eklenirken,
# .merge() ile veri tabanlarında yapılan işlemlere benzer şekilde sütunları birleştirebiliriz.
ulkeler_merge = pd.DataFrame({"Ülke":["Japonya", "Fransa", "Almanya"], "Kıta":["Asya", "Avrupa", "Avrupa"]})
baskent_merge = pd.DataFrame({"Ad":["Japonya", "Fransa", "Almanya"], "Başkent":["Tokyo", "Paris", "Berlin"]})
pd.merge(ulkeler_merge, baskent_merge, left_on="Ülke", right_on="Ad")
## left_on ile right_on, .merge() içine eklenen df ile aynı sırada olmalı. "Ülke"yi sağa, "Ad"ı sola yazınca hata verdi.

      Ülke    Kıta       Ad Başkent
0  Japonya    Asya  Japonya   Tokyo
1   Fransa  Avrupa   Fransa   Paris
2  Almanya  Avrupa  Almanya  Berlin

In [124]:
all_countries = pd.concat([ulkeler_merge, baskent_merge], axis=1)
all_countries

      Ülke    Kıta       Ad Başkent
0  Japonya    Asya  Japonya   Tokyo
1   Fransa  Avrupa   Fransa   Paris
2  Almanya  Avrupa  Almanya  Berlin

## Dosyalarla Çalışmak

Bir csv dosyası oluşturmak ve veri çerçevenizi aktarmak için **df.to_csv()** metodunu kullanırız.

**pd.read_csv()** gibi json dosyaları da **df=pd.read_json('data/Ulke_Bilgileri.json', encoding='utf8')** ile açılabilir.

Daha fazla bilgi için dökümantasyona ve iç içe (nested) json’u normalize etmek için **pandas.io.json.json_normalize()** metoduna bakabilirsiniz. 

Veri çerçevelerinizi dosyalara yazmak için mümkünse **csv**'yi tercih etmelisiniz, ancak **.to_json()** u bir veri çerçevesini json dosyası olarak yazmak için **df.to_json('dosyam.json')** olarak da kullanabilirsiniz.

**Encoding hakkında birkaç not:** _Unicode ve UTF-8_. Python 3'teki tüm stringler unicode’dur ve utf-8 mümkün olduğunda Python'un kullandığı varsayılan kodlamadır. Eğer dosyanızın kodlamasını manuel olarak belirleyemediyseniz **Chardet** ile istatistiksel bir saptamayı deneyebilirsiniz. Unicode, bilgisayar tarihine yakından bağlı olan derin bir konudur. Eğer unicode’un hızlı bir pratiğiyle ve geçmişine genel bakış ile ilgileniyorsanız Python belgelerinde bulunan Unicode HOWTO bölümü bunun için biçilmiş kaftandır.